app/views/projects/show.html.erb

SELECT COUNT(*) FROM "issues" WHERE "issues"."project_id" = ?  [["project_id", 1]]
---

There are currently <%= pluralize(@project.issues.count, 'issue') %> raised against this project