app/controllers/issues_controller.rb

  def index
    @issues = Issue.all
    @issue = Issue.new

    @project=Project.find(params[:project_id])
---
SELECT "issues".* FROM "issues"
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @issue = Issue.new(issue_params)

    respond_to do |format|
      if @issue.save
---
INSERT INTO "issues" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)

  def update
    respond_to do |format|
      if @issue.update(issue_params)
---
UPDATE "issues" SET "description" = ?, "updated_at" = ? WHERE "issues"."id" = 1  [["description", "Everything is broken without the possibility to fix. Its gone! Gone, I say!"], ["updated_at", Sat, 01 Feb 2014 16:20:25 UTC +00:00]]

    def set_issue
      @issue = Issue.find(params[:id])
---
SELECT "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT 1  [["id", "new"]]