app/controllers/organizations_controller.rb

SELECT "organizations".* FROM "organizations"
---
  def index
    @organizations = Organization.all

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_organization
      @organization = Organization.find(params[:id])