app/controllers/programs_controller.rb

SELECT "programs".* FROM "programs" WHERE "programs"."organization_id" IS NULL
---
  def index
    @programs = Program.find_all_by_organization_id(params[:organization_id])