app/controllers/static_controller.rb

SELECT COUNT(*) FROM "programs"
---
  def dashboard
    @programs=Program.count